app/Views/barangmasuk/viewdata.php

                        <td align="center">
                            <?php
                                $db = \Config\Database::connect();
                                $jumlahItem = $db->table('detail_barangmasuk')->where('detfaktur', $row['faktur'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `detail_barangmasuk`
WHERE `detfaktur` = 'FM1405230001'