app/Views/barangpermintaan/viewdata.php

SELECT COUNT(*) AS `numrows`
FROM `detail_barangpermintaan`
WHERE `detnosuratjalan` = 'FSJ0805230001'
---
                        <td align="center">
                            <?php
                                $db = \Config\Database::connect();
                                $jumlahItem = $db->table('detail_barangpermintaan')->where('detnosuratjalan', $row['nosuratjalan'])->countAllResults();