app/Controllers/Barang.php

    public function cetakkode($id = null)
    {
        $model = new Modelbarang();
        if($id==null){
            $data=$model->join('lokasi','lokid=brglokid')->orderBy('brgid', 'DESC')->findAll();
---
SELECT *
FROM `barang`
JOIN `lokasi` ON `lokid`=`brglokid`
ORDER BY `brgid` DESC

    public function get_data($id)
    {

        $model = new Modelbarang();

        $data = $model->where('brgid', $id)->first();
---
SELECT *
FROM `barang`
WHERE `brgid` = '4'
 LIMIT 1