app/Controllers/Barangpermintaan.php

SELECT *
FROM `barangpermintaan`
---
    public function data()
    {
        $dataBarang = new Modelbarangpermintaan();
        $data = [
            'databarang' => $dataBarang->findAll()
        ];