app/Controllers/Barang.php

    public function index()
    {
        $model = new Modelbarang();
        $data = [
            'tampildata' => $model->orderBy('brgid', 'DESC')->findAll()
        ];
---
SELECT *
FROM `barang`
ORDER BY `brgid` DESC

    public function get_data($id)
    {

        $model = new Modelbarang();

        $data = $model->where('brgid', $id)->first();
---
SELECT *
FROM `barang`
WHERE `brgid` = 1
 LIMIT 1