app/Controllers/Barangmasuk.php

    public function data()
    {
        $dataBarang = new Modelbarangmasuk();
        $data = [
            'databarang' => $dataBarang->findAll()
        ];
---
SELECT *
FROM `barangmasuk`