app/Controllers/EOQ.php

SELECT *
FROM `barang`
ORDER BY `brgkode` ASC
---
    public function index()
    {
        $model = new Modelbarang();
        $data = [
            'tampildata' => $model->orderBy('brgkode', 'DESC')->findAll()
        ];