app/Controllers/Kategori.php

SELECT *
FROM `kategori`
WHERE `isdeleted` != '1'
ORDER BY `katid` DESC
---
    public function index()
    {
        $model = new Modelkategori();
        $data = [
            'tampildata' => $model->where('isdeleted !=','1')->orderBy('katid', 'DESC')->findAll()
        ];

SELECT *
FROM `kategori`
WHERE `katid` = '3'
 LIMIT 1
UPDATE `kategori` SET `katid` = '3', `katnama` = 'Elektronik', `isdeleted` = 1
WHERE `kategori`.`katid` IN ('3')
---
    public function delete($id = null)
    {
        $model = new Modelkategori();
        //$delete = $model->where('katid', $id)->delete();
        $data = $model->where('katid', $id)->first();
        $data['isdeleted']=1;

        $update = $model->update($id, $data);