app/Controllers/Satuan.php

    public function index()
    {
        $model = new Modelsatuan();
        $data = [
            'tampildata' => $model->orderBy('satid', 'DESC')->findAll()
        ];
---
SELECT *
FROM `satuan`
ORDER BY `satid` DESC

    public function data_add($data)
    {

        $model = new Modelsatuan();
        $save = $model->insert_data($data);
        if ($save != false) {
            $data = $model->where('satid', $save)->first();
---
SELECT *
FROM `satuan`
WHERE `satid` = 7
 LIMIT 1

    public function get_data($id)
    {

        $model = new Modelsatuan();

        $data = $model->where('satid', $id)->first();
---
SELECT *
FROM `satuan`
WHERE `satid` = '2'
 LIMIT 1

    public function get_all()
    {

        $model = new Modelsatuan();

        $data = $model->orderBy('satid', 'DESC')->findAll();
---
SELECT *
FROM `satuan`
ORDER BY `satid` DESC

    public function data_update($data)
    {

        $model = new Modelsatuan();

        $id = $data['satid'];

        $update = $model->update($id, $data);
        if ($update != false) {
            $data = $model->where('satid', $id)->first();
---
SELECT *
FROM `satuan`
WHERE `satid` = '5'
 LIMIT 1

    public function delete($id = null)
    {
        $model = new Modelsatuan();
        $delete = $model->where('satid', $id)->delete();
---
DELETE FROM `satuan`
WHERE `satid` = '7'