app/Controllers/Satuan.php

    public function index()
    {
        $model = new Modelsatuan();
        $data = [
            'tampildata' => $model->where('isdeleted !=','1')->orderBy('satid', 'DESC')->findAll()
        ];
---
SELECT *
FROM `satuan`
WHERE `isdeleted` != '1'
ORDER BY `satid` DESC

    public function delete($id = null)
    {
        $model = new Modelsatuan();
        $data = $model->where('satid', $id)->first();
        $data['isdeleted']=1;
        //$delete = $model->where('satid', $id)->delete();
        $delete=$model->update($id, $data);
---
UPDATE `satuan` SET `satid` = '5'
WHERE `satuan`.`satid` IN ('5')