app/Controllers/Users.php

                ];
            } else {
                $modelUser = new Modeluser();
                $modelUser->insert([
                    'usernama' => $iduser,
                    'usernamalengkap' => $namalengkap,
                    'userlevelid' => $level,
                    'isdeleted'=>0
                ]);
---
INSERT INTO `users` (`usernama`, `usernamalengkap`, `userlevelid`, `isdeleted`) VALUES ('testsoftdelete', 'aaa', '3', 0)