app/Models/Modeldetailbarangpermintaan.php

SELECT *
FROM `detail_barangpermintaan`
JOIN `barang` ON `detbrgkode`=`brgkode`
WHERE `detnosuratjalan` = 'FSJ0905230001'
---
    public function dataDetail($faktur){
        $data=$this->table('detail_barangpermintaan')->join('barang','detbrgkode=brgkode')->where('detnosuratjalan', $faktur)->get()->getResult();