app/Models/Modelbarang.php

    public function insert_data($data) {
        if($this->db->table($this->table)->insert($data))
---
INSERT INTO `barang` (`brgid`, `brgnama`, `brgkatid`, `brgsatid`, `brgharga`, `brggambar`, `brgkode`, `brgstok`) VALUES ('0', 'Ember', 'Perabotan', 'PCS', '50000', '1683129983_5ad4effb56a8e8c4bcb7.png', NULL, '50')

    public function get_by_kode($kode){
        return $this->table('barang')->join('lokasi','brglokid=lokid')->Where('brgkode', $kode)->first();
---
SELECT *
FROM `barang`
JOIN `lokasi` ON `brglokid`=`lokid`
WHERE `brgkode` = 'L01R010523002'
 LIMIT 1