app/Models/Modelbarangkeluar.php

SELECT *
FROM `barangkeluar`
WHERE `tglfaktur` >= '2023-05-01'
AND `tglfaktur` <= '2023-05-31'
---
    public function laporanPerPeriode($tglawal, $tglakhir){
      return $this->table('barangkeluar')->where('tglfaktur >=', $tglawal)->where('tglfaktur <=', $tglakhir)->get();