app/Models/Modelsatuan.php

    public function insert_data($data) {
        if($this->db->table($this->table)->insert($data))
---
INSERT INTO `satuan` (`satid`, `satnama`, `isdeleted`) VALUES ('0', 'Test', 0)