app/Models/Modelbarangmasuk.php

    public function laporanPerPeriode($tglawal, $tglakhir){
        return $this->table('barangmasuk')->where('tglfaktur >=', $tglawal)->where('tglfaktur <=', $tglakhir)->get();
---
SELECT *
FROM `barangmasuk`
WHERE `tglfaktur` >= '2023-05-01'
AND `tglfaktur` <= '2023-05-31'