app/Models/Modeldetailbarangmasuk.php

    public function dataDetail($faktur){
        $data=$this->table('detail_barangmasuk')->where('detfaktur', $faktur)->get();
---
SELECT *
FROM `detail_barangmasuk`
WHERE `detfaktur` = 'FM1405230001'

    private function _get_datatables_query($tglawal, $tglakhir)
  {
      if ($tglawal=='' && $tglakhir==''){
          $this->dt = $this->table('detail_barangmasuk')
          ->join('barang', 'brgkode=detbrgkode')->join('barangmasuk','faktur=detfaktur')->join('users','userid=inputby');
      }else{
          $this->dt = $this->table('detail_barangmasuk')
          ->join('barang', 'brgkode=detbrgkode')->join('barangmasuk','faktur=detfaktur')->join('users','userid=inputby')
              ->where('tglfaktur >=', $tglawal)
              ->where('tglfaktur <=', $tglakhir);
---
SELECT *
FROM `detail_barangmasuk`
JOIN `barang` ON `brgkode`=`detbrgkode`
JOIN `barangmasuk` ON `faktur`=`detfaktur`
JOIN `users` ON `userid`=`inputby`
WHERE `tglfaktur` >= '2023-05-01'
AND `tglfaktur` <= '2023-05-31'