app/Models/Modeldetailbarangkeluar.php

    private function _get_datatables_query($tglawal, $tglakhir)
  {
      if ($tglawal=='' && $tglakhir==''){
          $this->dt = $this->table('detail_barangkeluar')
          ->join('barang', 'brgkode=detbrgkode')->join('barangkeluar','faktur=detfaktur')->join('users','userid=inputby');
      }else{
          $this->dt = $this->table('detail_barangkeluar')
          ->join('barang', 'brgkode=detbrgkode')->join('barangkeluar','faktur=detfaktur')->join('users','userid=inputby')
              ->where('barangkeluar.tglfaktur >=', $tglawal)
              ->where('barangkeluar.tglfaktur <=', $tglakhir);
---
SELECT *
FROM `detail_barangkeluar`
JOIN `barang` ON `brgkode`=`detbrgkode`
JOIN `barangkeluar` ON `faktur`=`detfaktur`
JOIN `users` ON `userid`=`inputby`
WHERE `barangkeluar`.`tglfaktur` >= '2023-05-01'
AND `barangkeluar`.`tglfaktur` <= '2023-05-04'

  public function count_all($tglawal, $tglakhir)
    {
        if ($tglawal=='' && $tglakhir==''){
            $tbl_storage = $this->db->table($this->table);
        }else{
            $tbl_storage = $this->table('detail_barangkeluar')
            ->join('barang', 'brgkode=detbrgkode')->join('barangkeluar','faktur=detfaktur')->join('users','userid=inputby')
                ->where('barangkeluar.tglfaktur >=', $tglawal)
                ->where('barangkeluar.tglfaktur <=', $tglakhir);
        }

        return $tbl_storage->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `detail_barangkeluar`
JOIN `barang` ON `brgkode`=`detbrgkode`
JOIN `barangkeluar` ON `faktur`=`detfaktur`
JOIN `users` ON `userid`=`inputby`
WHERE `barangkeluar`.`tglfaktur` >= '2023-05-01'
AND `barangkeluar`.`tglfaktur` <= '2023-05-04'