app/Models/Modelbarangpermintaan.php

SELECT *
FROM `barangpermintaan`
WHERE sha1(nosuratjalan) = '81020c330537b81a08af71da0d8a21fe389cde89'
---
    public function cekFaktur($faktur){
        return $this->table('barangmasuk')->Where('sha1(nosuratjalan)', $faktur)->get()->getResult();